tangyangguang/Esp32_Irrigation/src/web/IrrigationWeb.cpp
void writeStatusJson(const Irrigation::ZoneStatus& status) {
    Esp32BaseWeb::sendChunk("{\"zoneId\":");
    writeUInt(status.zoneId);
    Esp32BaseWeb::sendChunk(",\"state\":\"");
    Esp32BaseWeb::writeJsonEscaped(Irrigation::zoneStateName(status.state));
    Esp32BaseWeb::sendChunk("\",\"enabled\":");
    writeBool(status.enabled);
    Esp32BaseWeb::sendChunk(",\"busy\":");
    writeBool(status.busy);
    Esp32BaseWeb::sendChunk(",\"errorActive\":");
    writeBool(status.errorActive);
    Esp32BaseWeb::sendChunk(",\"targetSec\":");
    writeUInt(status.targetSec);
    Esp32BaseWeb::sendChunk(",\"elapsedSec\":");
    writeUInt(status.elapsedSec);
    Esp32BaseWeb::sendChunk(",\"remainingSec\":");
    writeUInt(status.remainingSec);
    Esp32BaseWeb::sendChunk(",\"pulses\":");
    writeUInt(status.pulses);
    Esp32BaseWeb::sendChunk(",\"estimatedMl\":");
    writeUInt(status.estimatedMilliliters);
    Esp32BaseWeb::sendChunk(",\"flowRatePerMinuteX1000\":");
    writeUInt(status.flowRatePerMinuteX1000);
    Esp32BaseWeb::sendChunk(",\"planId\":");
    writeUInt(status.planId);
    Esp32BaseWeb::sendChunk("}");
}

void writePlanJson(const Irrigation::PlanDefinition& plan) {
    Esp32BaseWeb::sendChunk("{\"exists\":");
    writeBool(plan.exists);
    Esp32BaseWeb::sendChunk(",\"planId\":");
    writeUInt(plan.planId);
    Esp32BaseWeb::sendChunk(",\"zoneId\":");
    writeUInt(plan.zoneId);
    Esp32BaseWeb::sendChunk(",\"slotIndex\":");
    writeUInt(plan.slotIndex);
    Esp32BaseWeb::sendChunk(",\"name\":\"");
    Esp32BaseWeb::writeJsonEscaped(plan.name);
    Esp32BaseWeb::sendChunk("\",\"enabled\":");
    writeBool(plan.enabled);
    Esp32BaseWeb::sendChunk(",\"time\":\"");
    writeTime(plan.timeHour, plan.timeMinute);
    Esp32BaseWeb::sendChunk("\",\"durationSec\":");
    writeUInt(plan.durationSec);
    Esp32BaseWeb::sendChunk(",\"cycleDays\":");
    writeUInt(plan.cycleDays);
    Esp32BaseWeb::sendChunk(",\"cycleMask\":");
    writeUInt(plan.cycleMask);
    Esp32BaseWeb::sendChunk(",\"cycleStartYmd\":");
    writeUInt(plan.cycleStartYmd);
    Esp32BaseWeb::sendChunk("}");
}

void writeOnePostHidden(const char* name, const char* value) {
    Esp32BaseWeb::sendChunk("<input type='hidden' name='");
    Esp32BaseWeb::writeHtmlEscaped(name);
    Esp32BaseWeb::sendChunk("' value='");
    Esp32BaseWeb::writeHtmlEscaped(value);
    Esp32BaseWeb::sendChunk("'>");
}

void writeHiddenU32(const char* name, uint32_t value) {
    char text[16];
    snprintf(text, sizeof(text), "%lu", static_cast<unsigned long>(value));
    writeOnePostHidden(name, text);
}

void writeHeadExtra() {
    Esp32BaseWeb::sendChunk("<style>"
                            ".irrigation-ui{--soft:#f8fafc;--line:#d8dee8;--ink:#1f2937;--muted2:#667085}"
                            ".irrigation-ui .zg{display:grid;grid-template-columns:repeat(auto-fit,minmax(230px,1fr));gap:14px}"
                            ".irrigation-ui .zc{border:1px solid var(--line);border-radius:8px;padding:14px;background:var(--soft)}"
                            ".irrigation-ui .zt{display:flex;align-items:center;justify-content:space-between;gap:10px;font-weight:400}"
                            ".irrigation-ui .actions{display:flex;flex-wrap:wrap;gap:8px;margin-top:12px}"
                            ".irrigation-ui button,.irrigation-ui input[type=submit],.irrigation-ui .btnlink{font-weight:400;background:#f4f6f8;color:var(--ink);border:1px solid #cbd5e1}"
                            ".irrigation-ui button.danger,.irrigation-ui input.danger{background:#fff1f2;color:#9f1239;border-color:#fecdd3}"
                            ".irrigation-ui .planrow{display:grid;grid-template-columns:minmax(0,1fr) auto;gap:12px;align-items:center;border-bottom:1px solid var(--line);padding:12px 0}"
                            ".irrigation-ui .planname{font-weight:400}"
                            ".irrigation-ui .planmeta,.irrigation-ui .muted2{color:var(--muted2);font-size:.92em}"
                            ".irrigation-ui .formsection{margin:14px 0 18px;padding-top:6px}"
                            ".irrigation-ui .formsection h3{font-size:1rem;font-weight:400;margin:0 0 10px}"
                            ".irrigation-ui .tablewrap table td,.irrigation-ui .tablewrap table th{font-weight:400}"
                            "</style>");
}

void pageHeader(const char* title) {
    Esp32BaseWeb::sendHeader(title);
    Esp32BaseWeb::sendChunk("<main class='irrigation-ui'>");
}

void pageFooter() {
    Esp32BaseWeb::sendChunk("</main>");
    Esp32BaseWeb::sendFooter();
}

void handleOverviewPage() {
    if (!Esp32BaseWeb::checkAuth()) return;
    pageHeader("灌溉总览");
    Esp32BaseWeb::sendPageTitle("灌溉总览", "固定 4 路 Zone，按水路独立运行。");
    Esp32BaseWeb::beginPanel("当前状态");
    Esp32BaseWeb::sendChunk("<div class='zg'>");
    for (uint8_t zoneId = 1; zoneId <= Irrigation::MaxZones; ++zoneId) {
        const Irrigation::ZoneStatus status = ZoneManager::status(zoneId);
        const Irrigation::ZoneConfig& config = ZoneManager::config(zoneId);
        Esp32BaseWeb::sendChunk("<div class='zc'><div class='zt'><span>");
        Esp32BaseWeb::writeHtmlEscaped(config.name);
        Esp32BaseWeb::sendChunk("</span><span class='tag");
        Esp32BaseWeb::sendChunk(uiToneForState(status.state));
        Esp32BaseWeb::sendChunk("'>");
        Esp32BaseWeb::writeHtmlEscaped(Irrigation::zoneStateName(status.state));
        Esp32BaseWeb::sendChunk("</span></div><p>目标 ");
        writeDuration(status.targetSec);
        Esp32BaseWeb::sendChunk("，剩余 ");
        writeDuration(status.remainingSec);
        Esp32BaseWeb::sendChunk("</p><p>脉冲 ");
        writeUInt(status.pulses);
        Esp32BaseWeb::sendChunk("，估算 ");
        writeUInt(status.estimatedMilliliters);
        Esp32BaseWeb::sendChunk(" ml</p><div class='actions'>");
        Esp32BaseWeb::sendChunk("<form method='post' action='/api/v1/zone/start' onsubmit=\"return confirm('确认启动该水路？')&&once(this)\">");
        writeOnePostHidden("source", "web_page");
        writeHiddenU32("zoneId", zoneId);
        writeHiddenU32("durationSec", SystemConfigStore::current().manualDefaultDurationSec);
        Esp32BaseWeb::sendChunk("<button type='submit'");
        Esp32BaseWeb::sendChunk((status.enabled && !status.busy && !status.errorActive && !ZoneManager::leakAlertActive()) ? "" : " disabled");
        Esp32BaseWeb::sendChunk(">启动</button></form>");
        Esp32BaseWeb::sendChunk("<form method='post' action='/api/v1/zone/stop' onsubmit=\"return confirm('确认停止该水路？')&&once(this)\">");
        writeOnePostHidden("source", "web_page");
        writeHiddenU32("zoneId", zoneId);
        Esp32BaseWeb::sendChunk("<button type='submit'");
        Esp32BaseWeb::sendChunk(status.busy ? "" : " disabled");
        Esp32BaseWeb::sendChunk(">停止</button></form>");
        if (status.errorActive) {
            Esp32BaseWeb::sendChunk("<form method='post' action='/api/v1/zone/clear-error' onsubmit=\"return confirm('确认现场已处理并清除异常？')&&once(this)\">");
            writeOnePostHidden("source", "web_page");
            writeHiddenU32("zoneId", zoneId);
            Esp32BaseWeb::sendChunk("<button type='submit'>清除异常</button></form>");
        }
        Esp32BaseWeb::sendChunk("</div></div>");
    }
    Esp32BaseWeb::sendChunk("</div><div class='actions'><form method='post' action='/api/v1/zones/stop-all' onsubmit=\"return confirm('确认停止全部水路？')&&once(this)\">");
    writeOnePostHidden("source", "web_page");
    Esp32BaseWeb::sendChunk("<button class='danger' type='submit'>全部停止</button></form></div>");
    Esp32BaseWeb::endPanel();
    pageFooter();
}

