tangyangguang/Esp32_Irrigation/src/web/IrrigationWeb.cpp
void writePlanRow(const Irrigation::PlanDefinition& plan) {
    Esp32BaseWeb::sendChunk("<div class='planrow'><div><span class='planname'>");
    Esp32BaseWeb::writeHtmlEscaped(plan.name);
    Esp32BaseWeb::sendChunk("</span><div class='planmeta'>");
    writeTime(plan.timeHour, plan.timeMinute);
    Esp32BaseWeb::sendChunk(" · ");
    writeDuration(plan.durationSec);
    Esp32BaseWeb::sendChunk(" · ");
    writeUInt(plan.cycleDays);
    Esp32BaseWeb::sendChunk(" 天循环 mask=");
    writeUInt(plan.cycleMask);
    Esp32BaseWeb::sendChunk("</div></div><div class='actions'><a class='btnlink info' href='/irrigation/plan?planId=");
    writeUInt(plan.planId);
    Esp32BaseWeb::sendChunk("'>编辑</a><form method='post' action='");
    Esp32BaseWeb::sendChunk(plan.enabled ? "/api/v1/plan/disable" : "/api/v1/plan/enable");
    Esp32BaseWeb::sendChunk("' onsubmit=\"return confirm('确认切换计划状态？')&&once(this)\">");
    writeOnePostHidden("source", "web_page");
    writeHiddenU32("planId", plan.planId);
    Esp32BaseWeb::sendChunk("<button type='submit'>");
    Esp32BaseWeb::sendChunk(plan.enabled ? "停用" : "启用");
    Esp32BaseWeb::sendChunk("</button></form><form method='post' action='/api/v1/plan/delete' onsubmit=\"return confirm('确认删除该计划？')&&once(this)\">");
    writeOnePostHidden("source", "web_page");
    writeHiddenU32("planId", plan.planId);
    Esp32BaseWeb::sendChunk("<button class='danger' type='submit'>删除</button></form></div></div>");
}

void handlePlansPage() {
    if (!Esp32BaseWeb::checkAuth()) return;
    pageHeader("计划");
    Esp32BaseWeb::sendPageTitle("计划", "每个 Zone 最多 6 条计划。");
    for (uint8_t zoneId = 1; zoneId <= Irrigation::MaxZones; ++zoneId) {
        Esp32BaseWeb::beginPanel(ZoneManager::config(zoneId).name);
        Esp32BaseWeb::sendChunk("<div class='actions'>");
        if (PlanStore::countForZone(zoneId) < Irrigation::MaxPlansPerZone) {
            Esp32BaseWeb::sendChunk("<a class='btnlink info' href='/irrigation/plan?zoneId=");
            writeUInt(zoneId);
            Esp32BaseWeb::sendChunk("'>新增计划</a>");
        } else {
            Esp32BaseWeb::sendChunk("<span class='tag'>计划已满</span>");
        }
        Esp32BaseWeb::sendChunk("</div>");
        for (uint8_t slot = 0; slot < Irrigation::MaxPlansPerZone; ++slot) {
            const Irrigation::PlanDefinition& plan = PlanStore::getBySlot(zoneId, slot);
            if (plan.exists) {
                writePlanRow(plan);
            }
        }
        if (PlanStore::countForZone(zoneId) == 0) {
            Esp32BaseWeb::sendChunk("<p class='muted'>暂无计划</p>");
        }
        Esp32BaseWeb::endPanel();
    }
    pageFooter();
}

Irrigation::PlanDefinition makeDraftPlan(uint8_t zoneId) {
    Irrigation::PlanDefinition plan = {};
    plan.exists = true;
    plan.zoneId = zoneId;
    strlcpy(plan.name, "新计划", sizeof(plan.name));
    plan.enabled = false;
    plan.timeHour = 7;
    plan.timeMinute = 0;
    plan.durationSec = SystemConfigStore::current().manualDefaultDurationSec;
    plan.cycleDays = 1;
    plan.cycleMask = 1;
    plan.cycleStartYmd = currentYmd();
    return plan;
}

bool applyPlanForm(Irrigation::PlanDefinition& plan, const char** error) {
    if (Esp32BaseWeb::hasParam("name") && !Esp32BaseWeb::getParam("name", plan.name, sizeof(plan.name))) {
        *error = "invalid_name";
        return false;
    }
    if (Esp32BaseWeb::hasParam("enabled") && !readBool("enabled", &plan.enabled)) {
        *error = "invalid_enabled";
        return false;
    }
    if (Esp32BaseWeb::hasParam("time") && !readTimeParam("time", &plan.timeHour, &plan.timeMinute)) {
        *error = "invalid_time";
        return false;
    }
    if (Esp32BaseWeb::hasParam("durationSec") && !readU32("durationSec", &plan.durationSec)) {
        *error = "invalid_duration";
        return false;
    }
    if (Esp32BaseWeb::hasParam("cycleDays") && !readU8("cycleDays", &plan.cycleDays)) {
        *error = "invalid_cycle_days";
        return false;
    }
    if (Esp32BaseWeb::hasParam("cycleMask") && !readU32("cycleMask", &plan.cycleMask)) {
        *error = "invalid_cycle_mask";
        return false;
    }
    if (Esp32BaseWeb::hasParam("cycleStartYmd") && !readYmd("cycleStartYmd", &plan.cycleStartYmd)) {
        *error = "invalid_cycle_start";
        return false;
    }
    if (plan.durationSec > SystemConfigStore::current().maxWateringDurationSec) {
        *error = "duration_exceeds_system_limit";
        return false;
    }
    return true;
}

void writePlanForm(const Irrigation::PlanDefinition& plan, bool creating) {
    Esp32BaseWeb::sendChunk("<form class='editform planform' method='post' action='");
    Esp32BaseWeb::sendChunk(creating ? "/api/v1/plan/create" : "/api/v1/plan/update");
    Esp32BaseWeb::sendChunk("' onsubmit=\"return confirm('确认保存计划？')&&once(this)\">");
    writeOnePostHidden("source", "web_page");
    if (creating) {
        writeHiddenU32("zoneId", plan.zoneId);
    } else {
        writeHiddenU32("planId", plan.planId);
    }
    Esp32BaseWeb::sendChunk("<div class='formsection'><h3>基本信息</h3><div class='fieldgrid'>"
                            "<p class='field med'><label>名称</label><input name='name' maxlength='31' value='");
    Esp32BaseWeb::writeHtmlEscaped(plan.name);
    Esp32BaseWeb::sendChunk("'></p><p class='field short'><label>状态</label><select name='enabled'><option value='0'");
    Esp32BaseWeb::sendChunk(plan.enabled ? "" : " selected");
    Esp32BaseWeb::sendChunk(">停用</option><option value='1'");
    Esp32BaseWeb::sendChunk(plan.enabled ? " selected" : "");
    Esp32BaseWeb::sendChunk(">启用</option></select></p></div></div>"
                            "<div class='formsection'><h3>执行</h3><div class='fieldgrid'><p class='field short'><label>开始时间</label><input name='time' type='time' value='");
    writeTime(plan.timeHour, plan.timeMinute);
    Esp32BaseWeb::sendChunk("'></p><p class='field short'><label>浇水时长秒</label><input name='durationSec' type='number' min='1' max='");
    writeUInt(SystemConfigStore::current().maxWateringDurationSec);
    Esp32BaseWeb::sendChunk("' value='");
    writeUInt(plan.durationSec);
    Esp32BaseWeb::sendChunk("'></p></div></div>"
                            "<div class='formsection'><h3>循环</h3><div class='fieldgrid'><p class='field short'><label>循环天数</label><input name='cycleDays' type='number' min='1' max='30' value='");
    writeUInt(plan.cycleDays);
    Esp32BaseWeb::sendChunk("'></p><p class='field short'><label>执行 mask</label><input name='cycleMask' type='number' min='1' value='");
    writeUInt(plan.cycleMask);
    Esp32BaseWeb::sendChunk("'></p><p class='field short'><label>起始日期</label><input name='cycleStartYmd' type='date' value='");
    writeYmdInput(plan.cycleStartYmd);
    Esp32BaseWeb::sendChunk("'></p></div></div><div class='actions'><button type='submit'>保存</button><a class='btnlink' href='/irrigation/plans'>返回</a></div></form>");
}

void handlePlanEditPage() {
    if (!Esp32BaseWeb::checkAuth()) return;
    uint32_t planId = 0;
    uint8_t zoneId = 0;
    Irrigation::PlanDefinition plan = {};
    const bool editing = Esp32BaseWeb::hasParam("planId");
    if (editing && (!readU32("planId", &planId) || !PlanStore::getById(planId, &plan))) {
        pageHeader("计划编辑");
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "计划不存在", "请返回计划页重新选择。");
        pageFooter();
        return;
    }
    if (!editing) {
        if (!readZoneId(&zoneId)) {
            pageHeader("新增计划");
            Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "水路不存在", "请返回计划页重新选择。");
            pageFooter();
            return;
        }
        plan = makeDraftPlan(zoneId);
    }
    pageHeader(editing ? "计划编辑" : "新增计划");
    Esp32BaseWeb::beginPanel(editing ? plan.name : ZoneManager::config(zoneId).name);
    writePlanForm(plan, !editing);
    Esp32BaseWeb::endPanel();
    pageFooter();
}

void handleSettingsPage() {
    if (!Esp32BaseWeb::checkAuth()) return;
    pageHeader("水路管理");
    Esp32BaseWeb::sendPageTitle("水路管理", "名称、启用状态、流量校准和错误策略。系统级参数在基础库 App Config 中设置。");
    for (uint8_t zoneId = 1; zoneId <= Irrigation::MaxZones; ++zoneId) {
        const Irrigation::ZoneConfig& zone = ZoneManager::config(zoneId);
        Esp32BaseWeb::beginPanel(zone.name);
        Esp32BaseWeb::sendChunk("<form class='editform' method='post' action='/api/v1/zone/config' onsubmit=\"return confirm('确认保存水路配置？')&&once(this)\">");
        writeOnePostHidden("source", "web_page");
        writeHiddenU32("zoneId", zoneId);
        Esp32BaseWeb::sendChunk("<div class='fieldgrid'><p class='field med'><label>名称</label><input name='name' maxlength='31' value='");
        Esp32BaseWeb::writeHtmlEscaped(zone.name);
        Esp32BaseWeb::sendChunk("'></p><p class='field short'><label>启用</label><select name='enabled'><option value='0'");
        Esp32BaseWeb::sendChunk(zone.enabled ? "" : " selected");
        Esp32BaseWeb::sendChunk(">停用</option><option value='1'");
        Esp32BaseWeb::sendChunk(zone.enabled ? " selected" : "");
        Esp32BaseWeb::sendChunk(">启用</option></select></p><p class='field short'><label>每升脉冲</label><input name='pulsePerLiter' type='number' min='1' max='10000' value='");
        writeUInt(zone.pulsePerLiter);
        Esp32BaseWeb::sendChunk("'></p><p class='field short'><label>校准 x1000</label><input name='calibrationX1000' type='number' min='100' max='10000' value='");
        writeUInt(zone.calibrationX1000);
        Esp32BaseWeb::sendChunk("'></p><p class='field short'><label>启动超时秒</label><input name='startTimeoutSec' type='number' min='1' max='300' value='");
        writeUInt(zone.startTimeoutSec);
        Esp32BaseWeb::sendChunk("'></p><p class='field short'><label>无脉冲超时秒</label><input name='flowNoPulseTimeoutSec' type='number' min='1' max='300' value='");
        writeUInt(zone.flowNoPulseTimeoutSec);
        Esp32BaseWeb::sendChunk("'></p><p class='field short'><label>抑制流量错误</label><select name='suppressError'><option value='0'");
        Esp32BaseWeb::sendChunk(zone.suppressError ? "" : " selected");
        Esp32BaseWeb::sendChunk(">否</option><option value='1'");
        Esp32BaseWeb::sendChunk(zone.suppressError ? " selected" : "");
        Esp32BaseWeb::sendChunk(">是</option></select></p></div><div class='actions'><button type='submit'>保存水路配置</button></div></form>");
        Esp32BaseWeb::endPanel();
    }
    pageFooter();
}

struct RecordJsonContext {
    bool first;
};

void writeRecordJson(const RecordStore::WateringRecord& record, void* user) {
    RecordJsonContext* ctx = static_cast<RecordJsonContext*>(user);
    if (!ctx->first) Esp32BaseWeb::sendChunk(",");
    ctx->first = false;
    Esp32BaseWeb::sendChunk("{\"recordId\":");
    writeUInt(record.recordId);
    Esp32BaseWeb::sendChunk(",\"zoneId\":");
    writeUInt(record.zoneId);
    Esp32BaseWeb::sendChunk(",\"taskType\":\"");
    Esp32BaseWeb::writeJsonEscaped(Irrigation::taskTypeName(static_cast<Irrigation::TaskType>(record.taskType)));
    Esp32BaseWeb::sendChunk("\",\"result\":\"");
    Esp32BaseWeb::writeJsonEscaped(Irrigation::taskResultName(static_cast<Irrigation::TaskResult>(record.result)));
    Esp32BaseWeb::sendChunk("\",\"planId\":");
    writeUInt(record.planId);
    Esp32BaseWeb::sendChunk(",\"planName\":\"");
    Esp32BaseWeb::writeJsonEscaped(record.planNameSnapshot);
    Esp32BaseWeb::sendChunk("\",\"targetSec\":");
    writeUInt(record.targetSec);
    Esp32BaseWeb::sendChunk(",\"startedEpoch\":");
    writeUInt(record.startedEpoch);
    Esp32BaseWeb::sendChunk(",\"endedEpoch\":");
    writeUInt(record.endedEpoch);
    Esp32BaseWeb::sendChunk(",\"estimatedMl\":");
    writeUInt(record.estimatedMilliliters);
    Esp32BaseWeb::sendChunk("}");
}

struct EventJsonContext {
    bool first;
};

void writeEventJson(const EventStore::Event& event, void* user) {
    EventJsonContext* ctx = static_cast<EventJsonContext*>(user);
    if (!ctx->first) Esp32BaseWeb::sendChunk(",");
    ctx->first = false;
    Esp32BaseWeb::sendChunk("{\"id\":");
    writeUInt(event.id);
    Esp32BaseWeb::sendChunk(",\"uptimeMs\":");
    writeUInt(event.uptimeMs);
    Esp32BaseWeb::sendChunk(",\"epoch\":");
    writeUInt(event.epoch);
    Esp32BaseWeb::sendChunk(",\"type\":\"");
    Esp32BaseWeb::writeJsonEscaped(EventStore::typeName(static_cast<Irrigation::EventType>(event.type)));
    Esp32BaseWeb::sendChunk("\",\"source\":\"");
    Esp32BaseWeb::writeJsonEscaped(EventStore::sourceName(static_cast<Irrigation::EventSource>(event.source)));
    Esp32BaseWeb::sendChunk("\",\"zoneId\":");
    writeUInt(event.zoneId);
    Esp32BaseWeb::sendChunk(",\"code\":");
    writeUInt(event.code);
    Esp32BaseWeb::sendChunk(",\"text\":\"");
    Esp32BaseWeb::writeJsonEscaped(event.text);
    Esp32BaseWeb::sendChunk("\"}");
}

struct RecordTableContext {
    bool wrote;
};

